In [3]:
import numpy as np
import pandas as pd

print("Pandas version:", pd.__version__)
print("Numpy version", np.__version__)

Pandas version: 2.1.4
Numpy version 1.26.4

In [13]:
obj = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])
obj

d    4
b    7
a   -5
c    3
dtype: int64

In [14]:
obj["a"]

-5

In [4]:
data = {
    "state": ["Ohio", "Ohio", "Ohio", "Neveda", "Neveda", "Neveda"],
    "year": [2000, 2001, 2002, 2001, 2002, 2003],
    "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
}

frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Neveda  2001  2.4
4  Neveda  2002  2.9
5  Neveda  2003  3.2

In [ ]:
frame.tail(2)

In [42]:
print(f"First 5 rows")
display(frame.head())

First 5 rows

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Neveda  2001  2.4
4  Neveda  2002  2.9

In [43]:
print("Population column:")
display(frame['state'])

Population column:

0      Ohio
1      Ohio
2      Ohio
3    Neveda
4    Neveda
5    Neveda
Name: state, dtype: object

In [46]:
frame['debt'] = 16.5
frame

    state  year  pop  debt
0    Ohio  2000  1.5  16.5
1    Ohio  2001  1.7  16.5
2    Ohio  2002  3.6  16.5
3  Neveda  2001  2.4  16.5
4  Neveda  2002  2.9  16.5
5  Neveda  2003  3.2  16.5

In [47]:
frame['eastern'] = frame.state == 'Ohio'
frame

    state  year  pop  debt  eastern
0    Ohio  2000  1.5  16.5     True
1    Ohio  2001  1.7  16.5     True
2    Ohio  2002  3.6  16.5     True
3  Neveda  2001  2.4  16.5    False
4  Neveda  2002  2.9  16.5    False
5  Neveda  2003  3.2  16.5    False

In [145]:
x = pd.Series([5, 2, 7, 9, 10])
y = pd.Series([1, 3, 5, 7, 9])
z = x * y
z

0     5
1     6
2    35
3    63
4    90
dtype: int64

In [143]:
def max_min_values(series):
    return np.x({'max': series.max(), 'min': series.min()})

print("Max:", x.max())
print("Min:", x.min())

Max: 10
Min: 2

In [59]:
data_with_nan = pd.Series([1, np.nan, 3.5, np.nan, 7])
data = pd.Series([1, 2, 3, 4, 5])
print("Original data:")
display(data_with_nan)

print("\nWhich values are missing:")
display(data_with_nan.isna())

print("\nWhich value is NOT missing:")
display(data_with_nan.notna())

sum(data_with_nan)

Original data:

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

Which values are missing:

0    False
1     True
2    False
3     True
4    False
dtype: bool

Which value is NOT missing:

0     True
1    False
2     True
3    False
4     True
dtype: bool

nan

In [27]:
data_fruits = {
    "fruit": ["Apple", "Banana", "Cherry", "Date"],
    "quantity": [100, 40, 200, 20]
}

inventory = pd.DataFrame(data_fruits)
inventory

inventory["price"] = [3.0, 4.0, 2.0, 5.0]
inventory

total_value = inventory.quantity * inventory.price
inventory["total_value"] = total_value
inventory

inventory["low_stock"] = inventory.quantity < 50
inventory

    fruit  quantity  price  total_value  low_stock
0   Apple       100    3.0        300.0      False
1  Banana        40    4.0        160.0       True
2  Cherry       200    2.0        400.0      False
3    Date        20    5.0        100.0       True

In [31]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                    index = ["Ohio", "Colorado", "Utah", "New York"],
                    columns = ["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
data.loc["Utah"]

In [ ]:
print("--- Row by Label ---")
display(data.loc["Colorado"])

print("--- Row by Position")
display(data.iloc[1])

In [46]:
data[data["three"]>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [47]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [55]:
import pandas as pd
import numpy as np

print("Drop rows 'Colorado' and 'Ohio':")
display(data.drop(['Colorado','Ohio']))

print("\nDrop column 'two':")
display(data.drop('two',axis=1))

Drop rows 'Colorado' and 'Ohio':

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

Drop column 'two':

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [ ]:
print("Drop rows 'Colorado' and 'Ohio':")
display(data.drop(['Colorado', 'Ohio'], inplace = True))

In [58]:
data

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [76]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                    index = ['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns = ['one', 'two', 'three', 'four'])

print("Display the rows for 'Utah' and 'New York' only:")
display(data)

display(data.loc[['Utah', 'New York']]) # Access multiple rows

display(data.loc['Ohio', 'two']) # Access single value

display(data['three']>5) # Access rows based on condition

data.loc['New York','four'] = 100
display(data)

Display the rows for 'Utah' and 'New York' only:

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

1

Ohio        False
Colorado     True
Utah         True
New York     True
Name: three, dtype: bool

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14   100

In [85]:
frame = pd.DataFrame({
    'b': [4, 7, -3, 2],
    'a': [0, 1, 0, 1]
}, index = ['Row3', 'Row2', 'Row1', 'Row4'])

frame

      b  a
Row3  4  0
Row2  7  1
Row1 -3  0
Row4  2  1

In [86]:
frame.sort_index()

      b  a
Row1 -3  0
Row2  7  1
Row3  4  0
Row4  2  1

In [89]:
frame.sort_values(by='b', ascending=False)

      b  a
Row2  7  1
Row3  4  0
Row4  2  1
Row1 -3  0

In [90]:
frame.sort_values(by='b', ascending=False, inplace=True)
frame

      b  a
Row2  7  1
Row3  4  0
Row4  2  1
Row1 -3  0

In [91]:
frame

      b  a
Row2  7  1
Row3  4  0
Row4  2  1
Row1 -3  0

In [ ]:
def label_size(val):
    return 'Big' if val > 2 else 'Small'

frame['size_label'] = frame['b'].apply(label_size)
frame

      b  a size_label
Row2  7  1      Small
Row3  4  0      Small
Row4  2  1      Small
Row1 -3  0      Small

In [108]:
scores = pd.DataFrame({
    'Student': ['Alice', 'Bob', 'Charlie', 'David'],
    'Math': [85, 45, 92, 60],
    'Science': [70, 55, 88, 72]
})

scores

scores.sort_values(by = ['Math'], ascending=False, inplace=True)
scores

scores['Math_Rank'] = scores['Math'].rank(ascending=False)
scores

   Student  Math  Science  Math_Rank
2  Charlie    92       88        1.0
0    Alice    85       70        2.0
3    David    60       72        3.0
1      Bob    45       55        4.0

In [112]:
def grade(score):
    return 'Pass' if score >= 60 else 'Fail'

scores['Status'] = scores['Math'].apply(grade)
scores

   Student  Math  Science  Math_Rank Status
2  Charlie    92       88        1.0   Pass
0    Alice    85       70        2.0   Pass
3    David    60       72        3.0   Pass
1      Bob    45       55        4.0   Fail

In [114]:
scores.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 2 to 1
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Student    4 non-null      object
 1   Math       4 non-null      int64
 2   Science    4 non-null      int64
 3   Math_Rank  4 non-null      float64
 4   Status     4 non-null      object
dtypes: float64(1), int64(2), object(2)
memory usage: 192.0+ bytes

In [116]:
scores.select_dtypes(exclude=['float64'])

   Student  Math  Science Status
2  Charlie    92       88   Pass
0    Alice    85       70   Pass
3    David    60       72   Pass
1      Bob    45       55   Fail

In [120]:
scores.sort_index(ascending=True, inplace=True)
scores

   Student  Math  Science  Math_Rank Status
0    Alice    85       70        2.0   Pass
1      Bob    45       55        4.0   Fail
2  Charlie    92       88        1.0   Pass
3    David    60       72        3.0   Pass

In [127]:
scores.tail(3)

   Student  Math  Science  Math_Rank Status
1      Bob    45       55        4.0   Fail
2  Charlie    92       88        1.0   Pass
3    David    60       72        3.0   Pass

In [154]:
df1 = pd.DataFrame({'A': [1, 2]}, index=[1, 2])
df2 = pd.DataFrame({'A': [10, 20]}, index=[2, 3])

df1 * df2

      A
1   NaN
2  20.0
3   NaN

In [160]:
nested_dict = {
    'A': {'a':1, 'b':2},
    'B': {'a':3, 'b':4}
}

df = pd.DataFrame(nested_dict)
df

   A  B
a  1  3
b  2  4